In [352]:
# This is Homework 06c (Further Material)
# of the "Data Science" class at Technische Hochschule Rosenheim

In [353]:
# import numpy and pandas
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [354]:
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

# Further Material

This notebook covers a couple of subjects we will need for the class and which are not contained in the textbook. It will introduce a number of methods - use the documentation to learn about the method and it's parameters!

https://pandas.pydata.org/pandas-docs/stable/

### Reading and Writing Data in Text Format

Use the DataFrame method `read_csv` for the following exercise.

You are given a dataset of "census income data" in csv format, each row represents one person with the following attributes: age, workclass, fnlwgt, education, education-num, marital-status, occupation, relationship, race, sex, capital-gain, capital-loss, hours-per-week, native-country, income.

You can find this dataset in 'data/adult.data'.

- read the data into a DataFrame 'adult'. Make sure to name the columns properly.
- verify that adults contains 32561 tupels.

In [355]:
## Solutions
adult = pd.read_csv("data/adult.data")
adult

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32555,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32556,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32557,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32558,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32559,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

### JSON, XML and HTML

Use the DataFrame method `to_json` for the following exercise.

- write the 'adult' DataFrame to a JSON file 'adult.data.json' in the 'output' directory.
- verify the contents of the file using a web browser.

In [356]:
## Solutions
# import os
# os.mkdir("./output")

adult.to_json("output/adult.data.json")

### Binary Data Formats

Use the DataFrame method `ExcelFile` for the following exercise.

There is another file containing income data, in Excel format: 'data/adult.test.xlsx'.
- open this excel file as 'xls_file'
- use the property 'sheet_names' to figure out the name of the Sheets in this Excel file.
- use the 'parse' method to read the (only) Sheet into a DataFrame 'adult_test' and verify the result by looking at the first 5 rows.

In [357]:
## Solutions
xls_file = pd.ExcelFile("data/adult.test.xls")
print(xls_file.sheet_names, len(xls_file.parse("AdultTest")))
xls_file.parse("AdultTest").head()

['AdultTest'] 16281

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K.
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K.
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K.
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K.
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K.

### Reindexing

Use the DataFrame methods `reindex` and `drop` for the following exercise.

You are given the following revenue data:

In [358]:
df3 = DataFrame({'2010': {'Hans':1500, 'Egon':2500, 'Ute':3500, 'Susi':4000, 'Klaus':2200}, 
                 '2011': {'Klaus': 6000, 'Uwe': 1500, 'Hans': 1000, 'Susi': 5000, 'Antonia':10000}})
df3.index.name = 'customer'
df3.columns.name='year'
df3

year        2010     2011
customer
Hans      1500.0   1000.0
Egon      2500.0      NaN
Ute       3500.0      NaN
Susi      4000.0   5000.0
Klaus     2200.0   6000.0
Uwe          NaN   1500.0
Antonia      NaN  10000.0

- Use reindexing to add a row for the new customer 'Bernd' between Antonia and Egon, setting all his revenues to 0 (call this df4)
- Use reindexing to add a column for the year 2012 to df4 and call this df5
- Use the drop method twice in one line to remove the year 2010 as well as Egon and Susi from df5, call the new DataFrame df6
- use indexing and slicing to set the revenue of Bernd, Egon, Hans and Klaus to 0 for the year 2012 in df5
- set all remaining unknown revenues (NaN) to -1 using boolean indexing

In [359]:
## Solutions
df4 = df3.reindex(["Hans", "Egon", "Ute", "Susi", "Klaus", "Bernd", "Uwe", "Antonia"])
df4.loc["Bernd"] = 0

df5 = df4.reindex(["2010", "2011", "2012"], axis=1)

df6 = df5.drop("2010", axis=1).drop(["Egon", "Susi"])

df5["2012"][["Hans","Egon","Klaus","Bernd"]] = 0

df5[df5.isna()] = -1

display("df4", "df5.astype(int)", "df6")

df4
year        2010     2011
customer
Hans      1500.0   1000.0
Egon      2500.0      NaN
Ute       3500.0      NaN
Susi      4000.0   5000.0
Klaus     2200.0   6000.0
Bernd        0.0      0.0
Uwe          NaN   1500.0
Antonia      NaN  10000.0

df5.astype(int)
year      2010   2011  2012
customer
Hans      1500   1000     0
Egon      2500     -1     0
Ute       3500     -1    -1
Susi      4000   5000    -1
Klaus     2200   6000     0
Bernd        0      0     0
Uwe         -1   1500    -1
Antonia     -1  10000    -1

df6
year         2011  2012
customer
Hans       1000.0   NaN
Ute           NaN   NaN
Klaus      6000.0   NaN
Bernd         0.0   NaN
Uwe        1500.0   NaN
Antonia   10000.0   NaN

### Sorting and Ranking

Use the DataFrame methods `sort_index`, `sort_values` and `rank` for the following exercise.

In [360]:
fra = DataFrame({'2010': {'Hans':1100, 'Klaus':200, 'Egon':300, 'Susi':400}, 
      '2012': {'Klaus': 1000, 'Jaques': 1100, 
               'Susanna': 5500, 'Julia':11100}})
fra.index.name = 'customer'
fra.columns.name='year'
fra.name = 'France'
fra

year        2010     2012
customer
Hans      1100.0      NaN
Klaus      200.0   1000.0
Egon       300.0      NaN
Susi       400.0      NaN
Jaques       NaN   1100.0
Susanna      NaN   5500.0
Julia        NaN  11100.0

- Sort the french customers by name
- Sort the french customers by revenue (descending) in 2012
- Now, rank the french customers by revenue (descending) in 2012, so that the customer with the highest revenue has rank 1, etc. Break ties by minimum rank, and show the result by ascending rank.
- Finally, select only the top-3 customers from the previous list.

In [361]:
## Solutions
sortedindex = fra.sort_index()
sortedvalues = fra.sort_values('2012', ascending=False)
sortedvaluesrank = sortedvalues.rank(ascending=False, method="min", na_option="bottom")
top3 = DataFrame(sortedvaluesrank["2012"][:3])
display("sortedindex", "sortedvalues", "sortedvaluesrank", "top3")

sortedindex
year        2010     2012
customer
Egon       300.0      NaN
Hans      1100.0      NaN
Jaques       NaN   1100.0
Julia        NaN  11100.0
Klaus      200.0   1000.0
Susanna      NaN   5500.0
Susi       400.0      NaN

sortedvalues
year        2010     2012
customer
Julia        NaN  11100.0
Susanna      NaN   5500.0
Jaques       NaN   1100.0
Klaus      200.0   1000.0
Hans      1100.0      NaN
Egon       300.0      NaN
Susi       400.0      NaN

sortedvaluesrank
year      2010  2012
customer
Julia      5.0   1.0
Susanna    5.0   2.0
Jaques     5.0   3.0
Klaus      4.0   4.0
Hans       1.0   5.0
Egon       3.0   5.0
Susi       2.0   5.0

top3
          2012
customer
Julia      1.0
Susanna    2.0
Jaques     3.0

### Unique Values and Value Counts

Use the DataFrame methods `unique` and `value_counts` for the following exercise.

You work behind the bar in a club and write down each cocktail you make in a list:

In [362]:
cocktails = Series(['Caipi', 'Mojito', 'Cuba Libre', 'Caipi', 'Caipi',
                   'Cuba Libre', 'Mojito', 'Caipi', 'Mojito'])

- Compute a list of all the different cocktails you made!
- How many cocktails of each kind did you make?

In [363]:
## Solutions
unq = DataFrame(cocktails.unique())
cnt = DataFrame(cocktails.value_counts())
display("unq", "cnt")

unq
            0
0       Caipi
1      Mojito
2  Cuba Libre

cnt
            count
Caipi           4
Mojito          3
Cuba Libre      2

### Removing/Replacing

Use the DataFrame methods `drop_duplicates` and `replace` for the following exercise.

Consider the following DataFrame 'work2' from our ERP system:

In [364]:
work2 = DataFrame({'job': ['Projektleiter', 'Gruppenleiter', 'Sachbearbeiter', '', '', 'Projektleiter', 
                          'Gruppenleiter', '', 'Sachbearbeiter', 'Sachbearbeiter', 'Sachbearbeiter'],
                  'prj_number': ['p1', 'p3', 'p2', 'p2', 'p2', 'p3', 'p1', 'p1', 'p2', 'p3', 'p1'], 
                  'emp_number': ['10102', '10102', '25348', '18316', '29346', '2581', '9031', 
                                 '28559', '28559', '9031', '29346']})
work2.sort_values("emp_number")

               job prj_number emp_number
0    Projektleiter         p1      10102
1    Gruppenleiter         p3      10102
3                          p2      18316
2   Sachbearbeiter         p2      25348
5    Projektleiter         p3       2581
7                          p1      28559
8   Sachbearbeiter         p2      28559
4                          p2      29346
10  Sachbearbeiter         p1      29346
6    Gruppenleiter         p1       9031
9   Sachbearbeiter         p3       9031

- Each employee should have only one job in one project: remove all but the last row which violates this condition, and save the result in a new DataFrame 'work3'
- The job title 'Sachbearbeiter' has been changed to 'Spezialist'. Create a new DataFrame 'work4' based on 'work3' which reflects this change.

In [365]:
## Solutions
work3 = work2.drop_duplicates("emp_number", keep="last")
work4 = work3.replace("Sachbearbeiter", "Spezialist")
display("work3", "work4")

work3
               job prj_number emp_number
1    Gruppenleiter         p3      10102
2   Sachbearbeiter         p2      25348
3                          p2      18316
5    Projektleiter         p3       2581
8   Sachbearbeiter         p2      28559
9   Sachbearbeiter         p3       9031
10  Sachbearbeiter         p1      29346

work4
              job prj_number emp_number
1   Gruppenleiter         p3      10102
2      Spezialist         p2      25348
3                         p2      18316
5   Projektleiter         p3       2581
8      Spezialist         p2      28559
9      Spezialist         p3       9031
10     Spezialist         p1      29346

### Discretization and Binning

Use the DataFrame methods `cut` and `qcut` for the following exercise.

You have an array of income numbers:

In [366]:
incomes = [10274, 47628, 34876, 78028, 113765, 1836, 16537, 65184, 55127, 55271, 76201, 73529, 23438, 26142]

- discretize these into the incomes up to 10k, more than 10k to 50k, more than 50k to 100k and more than 100k. Print the bins together with the number of incomes in each bin.
- in addition, name your bins 'poor', 'average', 'rich' and 'filthyrich'. Again, print the bins together with the number of incomes in each bin.
- discretize these into the 4 quantiles called '25%', '50%', '75%' and '100%'. Again, print the bins together with the number of incomes in each bin.

Hint: the `max` method may be helpful as well!

In [367]:
## Solutions
cuts = pd.cut(incomes, [0,10000,50000,100000,max(incomes)], True, ["poor", "avergage", "rich", "filthy"]).value_counts()
qcuts = pd.qcut(incomes, [0, 0.25, 0.5, 0.75, 1]).value_counts()
display("DataFrame(cuts)", "DataFrame(qcuts)")

DataFrame(cuts)
          count
poor          1
avergage      6
rich          6
filthy        1

DataFrame(qcuts)
                      count
(1835.999, 24114.0]       4
(24114.0, 51377.5]        3
(51377.5, 71442.75]       3
(71442.75, 113765.0]      4

### Outliers and Random Sampling

As will define as outliers all incomes of 9000 or less and of 99000 or more.
- convert 'incomes' to a DataFrame 'incomedf'
- compute all outliers in 'incomedf'
- change all outliers in 'incomedf' to the value -1. Verify that they are indeed -1.

Use the DataFrame method `take` for the following exercise. In addition, `np.random.permutation` and `np.random.randint` may be helpful.

- draw a random sample of 5 incomes from 'incomedf' without replacement
- draw a random sample of 20 incomes from 'incomedf' with replacement

Hint: Binary and Fancy indexing will be useful for all these exercises.

In [406]:
## Solutions
incdf = DataFrame(incomes, columns=["income"])
outliers = DataFrame(incdf.eval("income <= 9000 or income >= 99000"))
incdf2 = incdf.copy()
incdf2[outliers] = -1

shuffled = incdf.take(np.random.permutation(5))
replacment = incdf.take(np.random.randint(0, len(incdf), 20))


display("incdf", "outliers", "incdf2", "shuffled", "replacment")

incdf
    income
0    10274
1    47628
2    34876
3    78028
4   113765
5     1836
6    16537
7    65184
8    55127
9    55271
10   76201
11   73529
12   23438
13   26142

outliers
    income
0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
8    False
9    False
10   False
11   False
12   False
13   False

incdf2
    income
0    10274
1    47628
2    34876
3    78028
4       -1
5       -1
6    16537
7    65184
8    55127
9    55271
10   76201
11   73529
12   23438
13   26142

shuffled
   income
3   78028
1   47628
2   34876
4  113765
0   10274

replacment
    income
12   23438
13   26142
2    34876
2    34876
7    65184
12   23438
9    55271
11   73529
0    10274
3    78028
8    55127
11   73529
9    55271
12   23438
9    55271
12   23438
7    65184
10   76201
11   73529
5     1836

---